# Change runtime type to R

Remember, the first step when opening a Google Colab notebook is to change the runtime type to R from Python. Our code will not work otherwise!

# Load the packages and data into R

At the beginning of any R project and before anything can really begin, we have two steps:

1) Load the packages that we will use.

2) Load the data in R (if it isn't already loaded into the system).

It helps keep the "work space" clean to load all the packages up front so that you know where they are loaded and can easily see which packages are required.

For now, the data we will use is located in R or in some packages. We will learn how to load external data into R at a later date.

In [2]:
## Load package(s)
library(dplyr) ## This package is used for data wrangling
library(readr) ## This is used to load our data

I am going to pull a dataset from my person GitHub page. You will not need to know how to accomplish this **but you will need to run the code to successfully pull the data into R**.

In [5]:
## GitHub URL for GenderPay.csv dataset
urlfile <- "https://raw.githubusercontent.com/CaseyGio/Psyc6290/refs/heads/main/GenderPay.csv"

## Load the dataset from the GitHub repository
GenderPay <- read_csv(url(urlfile))

## See if the data loaded
head(GenderPay)

New names:
• `` -> `...1`
Rows: 1000 Columns: 10
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr (4): jobTitle, gender, edu, dept
dbl (6): ...1, age, perfEval, seniority, basePay, bonus

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

  ...1 jobTitle            gender age perfEval edu     dept           seniority
1 1    Graphic Designer    Female 18  5        College Operations     2
2 2    Software Engineer   Male   21  5        College Management     5
3 3    Warehouse Associate Female 19  4        PhD     Administration 5
4 4    Software Engineer   Male   20  5        Masters Sales          4
5 5    Graphic Designer    Male   26  5        Masters Engineering    5
6 6    IT                  Female 20  5        PhD     Operations     4
  basePay bonus
1  42363   9938
2 108476  11128
3  90208   9268
4 108080  10154
5  99464   9319
6  70890  10126

# The pipe operator: %>%

Windows keyboard shortcut: ctrl + shift + m

A tool that is very commonly used in R to create *readable* code is the pipe operator: %>%. Without the pipe operator, functions are nested within each other and read from the middle out (yikes!). The pipe operator allows us to chain functions together that are sequentially executed.

The pipe operator works as follows: Using the output from line 1, do something in line 2. From the output in line 2, do something in line 3, etc. It *pipes* the output from one line to be the input for the next line of code.

Consider a simple example below:

In the first line of code, we generate 20 random numbers with a mean and SD of 0 and 1, respectively.

Then we apply two functions, round these values to 2 digits and sum them. Both answers are doing exactly the same thing.

In [ ]:
## Generate 20 random numbers from a normal distribution
x <- rnorm(n = 20, mean = 0, sd = 1)

## See what the vector that we created looks like
x

## Round using the pipe operator
x %>%
  round(digits = 2) %>%
  sum()

## Round using the traditional way
sum(round(x, digits = 2))

## Pipe operator notes

A couple things to note about the pipe operator:

1) The code I ran above *does not save the final output to an object*. By default, the pipe operator just carries out functions. If you want to save the results for later use, **use the assignment operator to create an object**.

In [ ]:
## Create an object, named XSum, to store the results
XSum <-
  x %>%
  round(digits = 2) %>%
  sum()

## Return the output
XSum

2) The pipe operator takes the output from the previous line of code and inserts it as the first argument of the next line of code. Notice how in the round() function, we did not specify which data to round? R interprets the pipe operator as the data that we want to round because the data argument is the first argument.

# Data Wrangling

Most of the time, data are not in a format that we want them to be. We must take steps to get the data into a format that we can actually analyze. This process is known as data wrangling or data cleaning. Just like ggplot2 is the primary and most powerful data visualization package, dplyr is the primary and most powerful data wrangling package.

Major elements to data wrangling

a) Filter out specific rows

b) Select specific columns

c) Summarize data with descriptive statistics

d) Cross tabulate data with group_by

e) Mutate data to create new variables

f) Arrange/sort the data (e.g., alphabetical, decreasing numbers)

g) Joining data objects together based on a key variable (e.g., person ID)

## Filter rows

Let's explore the dataset GenderPay. This dataset includes categorical variables (e.g., gender, education, department) and continuous variables (e.g., age, basePay, bonus).

- JobTitle: Character vector of job titles (Graphic Designer, Software Engineer, Warehouse Associate, IT, Sales Associate, Driver, Financial Analyst, Marketing Associate, Data Scientist, Manager).

- gender: Character vector with two categories (Female, Male).

- age: Numeric vector of employee ages.

- perfEval: Numeric integer value for annual performance evaluation scores.

- edu: Character vector of education levels (College, PhD, Masters, High School).

- dept: Character vector of department titles for each employee (Operations, Management, Administration, Sales, Engineering).

- seniority: Integer values that actually represent categories (1, 2, 3, 4, 5).

- basePay: Numeric value for the base pay for each person.

- bonus: Numeric value for the added bonus pay for each person.

In [8]:
## See the first few rows/columns of the dataset
head(GenderPay)

  ...1 jobTitle            gender age perfEval edu     dept           seniority
1 1    Graphic Designer    Female 18  5        College Operations     2
2 2    Software Engineer   Male   21  5        College Management     5
3 3    Warehouse Associate Female 19  4        PhD     Administration 5
4 4    Software Engineer   Male   20  5        Masters Sales          4
5 5    Graphic Designer    Male   26  5        Masters Engineering    5
6 6    IT                  Female 20  5        PhD     Operations     4
  basePay bonus
1  42363   9938
2 108476  11128
3  90208   9268
4 108080  10154
5  99464   9319
6  70890  10126

What if we wanted to see only the data for people with a Master's degree? We *filter* out the rows we don't want to only include the rows we do want.

In [9]:
## Filter GenderPay to only show people with Master's degree
GenderPay %>%
  filter(edu == "Masters") %>%
  head()

## Note that we did not "save" the filtered version as an object

  ...1 jobTitle            gender age perfEval edu     dept           seniority
1  4   Software Engineer   Male   20  5        Masters Sales          4
2  5   Graphic Designer    Male   26  5        Masters Engineering    5
3 14   Warehouse Associate Female 30  5        Masters Administration 5
4 27   Software Engineer   Male   19  5        Masters Administration 4
5 31   Software Engineer   Male   20  5        Masters Management     2
6 32   Sales Associate     Male   35  5        Masters Management     5
  basePay bonus
1 108080  10154
2  99464   9319
3  86220   9583
4 100305   9618
5  66359  10137
6 103007  10512

  ...1 jobTitle            gender age perfEval edu     dept           seniority
1 1    Graphic Designer    Female 18  5        College Operations     2
2 2    Software Engineer   Male   21  5        College Management     5
3 3    Warehouse Associate Female 19  4        PhD     Administration 5
4 4    Software Engineer   Male   20  5        Masters Sales          4
5 5    Graphic Designer    Male   26  5        Masters Engineering    5
6 6    IT                  Female 20  5        PhD     Operations     4
  basePay bonus
1  42363   9938
2 108476  11128
3  90208   9268
4 108080  10154
5  99464   9319
6  70890  10126

### Filter requires logical arguments

Note that above we use a double equals sign (i.e., ==) within the filter function. The way we read this is "take the column edu and only include rows with the exact value of 'Masters'". The data in column edu are categorical and encoded as character strings, hence the quotes around the word to specify that it is a word (vs a number).

Types of logical statements in R

- \> is the "greater than" sign

- \< is the "less than" sign

- \>= and \<= are the "greater than or equal to" and "less than or equal to" signs, respectively

- != is the "not equal to" sign. Note that the "!" symbol, in R, is known as negation. In other words, the exclamation point is interpreted as "not". When combined with an equal sign, it means "not equal" but there are other uses for ! as well.

- == is the "equal to" sign

- \| is the "or" operator (between enter & backspace key)

- \& is the "and" operator

With these, we can filter on different columns and even with multiple filtering criteria. This is a personal preference but I prefer to use multiple filter functions rather than one function with multiple criteria, the former approach seems more *readable* than the latter.

In [13]:
## Filter so we include masters degrees between the ages of 30 and 60
WrangledPay1 <-
  GenderPay %>%
  filter(edu == "Masters" & age >= 30 & age <= 60)

## Multiple filter functions to do the same thing but easier to read/edit
WrangledPay2 <-
  GenderPay %>%
  filter(edu == "Masters") %>%
  filter(age >= 30) %>%
  filter(age <= 60)

## See the first few rows of a filtered dataset
head(WrangledPay1)

## Show that both filtered data objects are equivalent (value of TRUE means they are exactly equal)
all.equal(WrangledPay1, WrangledPay2)

  ...1 jobTitle            gender age perfEval edu     dept           seniority
1 14   Warehouse Associate Female 30  5        Masters Administration 5
2 32   Sales Associate     Male   35  5        Masters Management     5
3 54   Data Scientist      Female 33  5        Masters Sales          2
4 62   Graphic Designer    Male   34  5        Masters Management     3
5 88   Data Scientist      Female 38  5        Masters Administration 5
6 92   Financial Analyst   Female 36  5        Masters Administration 3
  basePay bonus
1  86220   9583
2 103007  10512
3  89415   9654
4  86766   9841
5 127156   9979
6  92622   8509

[1] TRUE

We can see an example of the remaining types of logical statements below:

In [15]:
## basePay greater than 100k
GenderPay %>%
  filter(basePay > 100000) %>%
  head()

  ...1 jobTitle            gender age perfEval edu         dept
1  2   Software Engineer   Male   21  5        College     Management
2  4   Software Engineer   Male   20  5        Masters     Sales
3  9   Graphic Designer    Female 33  5        High School Engineering
4 10   Sales Associate     Female 35  5        College     Engineering
5 11   Graphic Designer    Male   24  5        PhD         Engineering
6 21   Warehouse Associate Male   36  5        PhD         Engineering
  seniority basePay bonus
1 5         108476  11128
2 4         108080  10154
3 5         112976   9836
4 5         106524   9941
5 5         102261  10212
6 5         108446   9210

In [ ]:
## Education *not equal to* (i.e., excludes) PhD
GenderPay %>%
  filter(edu != "PhD") %>%
  head()

In [ ]:
## Performance eval scores of either 4 or 5
GenderPay %>%
  filter(perfEval == 4 | perfEval == 5) %>%
  head()

In [ ]:
## bonus less than 5k
GenderPay %>%
  filter(bonus < 5000) %>%
  head()

## Select specific columns from a dataset

Whereas the filter() function will remove data row-wise, the select() function will remove data column-wise. For example, say we are only interested in 3 columns: Gender, performance evaluation, and base pay. We can apply the select() function to do so.

In [ ]:
## Only retain gender, perfEval, and basePay columns
GenderPay %>%
  select(gender, perfEval, basePay)

## Summarize data (descriptive stats)

Using the summarize() funciton, we can use the mean() and sd() functions to compute the mean and standard deviations (respectively) for individual columns in the dataset.

The arguments are a little strange in summarize(). The way we read/use it is as follows: summarize(NameOfOutput = Function(ColumnName)). For example, we can summarize the column age, based on the mean and SD, and return labels for those values.

In [ ]:
## Summarize sample ages
GenderPay %>%
  summarize(AgeMean = mean(age),
            AgeSD   = sd(age))

Inside the statistical functions (e.g., mean() or sd()), we can include additional arguments like we normally would. For example, if there are missing data, we can ignore NA values. In this dataset, we do not have missing values so this just returns the same thing as above.

In [ ]:
## Summarize sample ages, ignoring missing values
GenderPay %>%
  summarize(AgeMean = mean(age, na.rm = TRUE),
            AgeSD   = sd(age, na.rm = TRUE))

## Group data by values from a column

The focal dataset is trying to compare gender pay disparities so general averages do not mean as much, we want to know *stratified* averages. For example, the average *within* females vs the average *within* males. This is accomplished by the group_by() function.

In [ ]:
## Average pay within each gender
GenderPay %>%
  group_by(gender) %>%
  summarize(PayMean = mean(basePay),
            PaySD   = sd(basePay))

In [ ]:
## Average pay within each gender AND performance evaluation score
GenderPay %>%
  group_by(gender, perfEval) %>%
  summarize(PayMean = mean(basePay))

In [ ]:
## Average pay within each performance evaluation score
GenderPay %>%
  group_by(perfEval) %>%
  summarize(PayMean = mean(basePay),
            PaySD   = sd(basePay))

## Mutate to create variables

The mutate() function creates new variables from existing data. For example, converting a column to a different unit (e.g., inches to centimeters) or combining two columns as a new total score.

Just like with the summarize function, the same format is used for inputs. For example, creating a new 'total' column by adding values from two other columns may be executed as follows: mutate(NewVariable = Column1 + Column2)

In [ ]:
## Create a new total pay column by adding 2 others
GenderPay %>%
  mutate(TotalPay = basePay + bonus) %>%
  select(basePay, bonus, TotalPay)

### Mutate a mutated column

The newly created variable can be used to create even more variables! Maybe we wish to know the percentage of compensation from base pay versus bonus. Let's formalize this as "percentage of total pay from bonuses", which is computed as (bonus / TotalPay) * 100.

In [18]:
## Create a 2 new columns: TotalPay and BonusPercent
GenderPayTotal <-
  GenderPay %>%
  mutate(TotalPay = basePay + bonus) %>%
  mutate(BonusPercent = (bonus / TotalPay) * 100)

## Return only 4 columns for simplicity
GenderPayTotal %>%
  select(basePay, bonus, TotalPay, BonusPercent) %>%
  head() ## Only show a few rows

  basePay bonus TotalPay BonusPercent
1  42363   9938  52301   19.001549
2 108476  11128 119604    9.304037
3  90208   9268  99476    9.316820
4 108080  10154 118234    8.588054
5  99464   9319 108783    8.566596
6  70890  10126  81016   12.498766

In [19]:
## Summarize the average compensation based on gender
GenderPayTotal %>%
  group_by(gender) %>%
  summarize(TPMean = mean(TotalPay),
            BPMean = mean(BonusPercent))

  gender TPMean    BPMean
1 Female  96416.83 7.241017
2 Male   104918.68 6.585840

Voila, we have come to some simple conclusions from simple data cleaning and descriptive statistics!

- Females tend to have slightly less pay on average

- Females tend to have slightly more of their compensation based on bonuses

In [ ]:
## Convert column 'gender' to 'Sex'
GenderPay %>%
  rename(Sex = gender)

## Recode

Whereas rename() will change the variable name, recode() is useful to changing the values of a categorical variable. This is useful for graphing reasons (e.g., recode M and F to Male and Female, respectively).

Basically, we are overwriting a column (or creating a new column) using the mutate() function and specifying the recoding scheme within that function. For instance, we read the recode() function inputs as (a) which column is being recoded (gender) and (b) the mapping of OldValue = NewValue.

In [21]:
## Recode gender values to man and woman
GenderPay %>%
  mutate(gender = recode(gender, "Male" = "Man", "Female" = "Woman")) %>%
  head()

  ...1 jobTitle            gender age perfEval edu     dept           seniority
1 1    Graphic Designer    Woman  18  5        College Operations     2
2 2    Software Engineer   Man    21  5        College Management     5
3 3    Warehouse Associate Woman  19  4        PhD     Administration 5
4 4    Software Engineer   Man    20  5        Masters Sales          4
5 5    Graphic Designer    Man    26  5        Masters Engineering    5
6 6    IT                  Woman  20  5        PhD     Operations     4
  basePay bonus
1  42363   9938
2 108476  11128
3  90208   9268
4 108080  10154
5  99464   9319
6  70890  10126

## Arranging data to sort data within a column

In many cases, we want to use the arrange() function to sort the data within a column in either ascending or descending order. For instance, maybe we have job applicants and their scores on various assessments (e.g., interview, job experience, and personality test score) and their overall score. Ideally, we want to sort candidates so that the top scores are presented first and hire candidates with those top scores. This would be accomplished using arrange().

### Ascending order (default)

By default, the arrange() function will sort data from a specified column to start with the lowest number at the top and end with the largest number at the bottom. This is ascending order. Let's arrange the basePay column based on this ascending order.

In [ ]:
## Arrange basePay in ascending order
GenderPay %>%
  arrange(basePay) %>%
  select(basePay)

### Descending order (using desc() function)

To present the same dataset with basePay shown in descending order (i.e., highest number first, lowest number last), we apply the desc() function to the specified column *within* the arrange() function.

The example below reverses the order of the basePay column from the example above.

In [ ]:
## Arrange basePay column in descending order
GenderPay %>%
  arrange(desc(basePay)) %>%
  select(basePay)